---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassRoof
source: html/cac7def7-554e-761b-d4f2-7d85621e3677.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassRoof Property

"Mass Roof"

## Syntax (C#)
```csharp
public static ForgeTypeId DefaultConstructionMassRoof { get; }
```